
const sources = [
    {
        id: 0,
        q: "Это вопрос 0 \n",
        opt: 2,
        a1: 1,
        a2: 2,
        res: 0,
        used: 0
    },
    {
        id: 1,
        q: "Это вопрос 0-1 \n",
        opt: 2,
        a1: 1,
        a2: 2,
        res: 0,
        used: 0
    },
    {
        id: 2,
        q: "Это вопрос 0-2 \n",
        opt: 2,
        a1: 1,
        a2: 2,
        res: 0,
        used: 0
    },
    {
        id: 11,
        q: "Это вопрос 0-1-1 \n ",
        opt: 2,
        a1: 1,
        a2: 2,
        res: 0,
        used: 0
    },
    {
        id: 12,
        q: "Это вопрос 0-1-2 \n ",
        opt: 2,
        a1: 1,
        a2: 2,
        res: 0,
        used: 0
    },
    {
        id: 21,
        q: "Это вопрос 0-2-1 \n ",
        opt: 2,
        a1: 1,
        a2: 2,
        res: 0,
        used: 0
    },
    {
        id: 22,
        q: "Это вопрос 0-2-2 \n",
        opt: 2,
        a1: 1,
        a2: 2,
        res: 0,
        used: 0
    },
    {
        id: 111,
        q: "Это результат 0-1-1-1",
        opt: 0
    },
    {
        id: 112,
        q: "Это результат 0-1-1-2 ",
        opt: 0
    },
    {
        id: 121,
        q: "Это результат 0-1-2-1",
        opt: 0
    },
    {
        id: 122,
        q: "Это результат 0-1-2-2 ",
        opt: 0
    },
    {
        id: 211,
        q: "Это результат 0-2-1-1",
        opt: 0
    },
    {
        id: 212,
        q: "Это результат 0-2-1-2",
        opt: 0
    },
    {
        id: 221,
        q: "Это результат 0-2-2-1",
        opt: 0
    },
    {
        id: 222,
        q: "Это результат 0-2-2-2",
        opt: 0
    },
]
